<template>
  <div class="user-agreement">
    <div class="header" @click="back">
      <div class="header-left">
        <img class="logo" src="../../assets/layout/aside/logo.png" alt="公司logo">
        <span class="name" >西安启明荣光科技有限公司</span>
      </div>
      <span class="header-right">注册账号</span>
    </div>
    <div class="content">
    <h3 class="title">用户许可协议条款</h3>
    <p class="content-main">
      重要须知：本《最终用户许可协议》（以下简称“本协议”）是您（个人、公司、或其他组织）与西安启明荣光科技有限公司及关联公司（以下简称"启明荣光"）签订的关于本软件的最终用户使用许可协议。启明荣光在此特别提示您仔细阅读本协议中各条款，包括但不限于用户使用须知、法律责任与免责等。<br/>
      您的安装、注册、使用行为将视为接受本协议。一旦安装或以任何方式使用本软件，即表示您已同意接受本协议的约束。如果您不同意本协议的条款，则不能获得安装、注册、使用本软件的权利。<br/>
      本协议是您与启明荣光就您下载、安装、注册、使用本软件所订立的协议。本协议约定与您关于本软件使用许可方面的权利义务。<br/>
      1、知识产权声明<br/>
      本软件由启明荣光开发或者由启明荣光获得软件权利人（以下简称“许可人”）许可。本软件的知识产权以及与本软件相关的所有信息内容，包括但不限于：文字表述及其组合、图标、图饰、图表、色彩、界面设计、版面框架、有关数据、印刷材料、电子文档等，均受著作权法和国际著作权条约以及其他知识产权法律、法规的保护，其知识产权均归启明荣光及其许可人所有。<br/>
      2、软件的许可<br/>
      （1）本协议未明示授权的其他一切权利均归启明荣光及其许可人所有，如果您需要使用本协议未授予的任何其他权利，须另行取得启明荣光的书面同意。<br/>
      （2）您通过本软件使用第三方的应用服务，应另行与该第三方签订服务协议。<br/>
      （3）启明荣光许可您在手机上下载、安装、运行本软件。该许可是有限的、不可转让的、不可分许可的、可撤销的、非独占的、非排他的。<br/>
      （4）您只能在一台手机上下载、安装、运行本软件的一份副本。<br/>
      3、用户账户注册<br/>
      （1）您承诺以真实身份注册成为本软件的用户，并保证所提供的企业、个人身份资料信息真实、完整、有效，并对您所提供的信息承担相应的法律责任。<br/>
      （2）您以其真实身份注册成为本软件用户后，需要修改所提供的企业、个人身份资料信息的，启明荣光将及时、有效地为其提供该项服务，但出于安全性和身份识别的考虑，你无法修改注册时提供的初始注册信息及其他验证信息。<br/>
      4、用户账号使用与保管<br/>
      （1）启明荣光有权审查您注册所提供的身份信息是否真实、有效，并将采取专业加密存储与传输方式等合理措施保障用户账号的安全、有效；您有义务妥善保管您的账号及密码，并正确、安全地使用您的账号及密码。任何一方未尽上<br/>述义务导致账号密码遗失、账号被盗等情形而给您和他人的民事权利造成损害的，应当承担由此产生的法律责任。<br/>
      （2）您对登录后所持账号产生的行为依法享有权利和承担责任。<br/>
      （3）如果您发现您的账号或密码被他人非法使用或有使用异常的情况的，应及时根据启明荣光公布的处理方式通知启明荣光，并有权通知启明荣光采取措施暂停该账号的登录和使用。<br/>
      （4）启明荣光根据您的通知采取措施暂停您的账号的登录和使用的，将会要求您提供并核实与其注册身份信息相一致的个人有效身份信息。<br/>
      （5）启明荣光核实您所提供的个人有效身份信息与所注册的身份信息相一致的，将及时采取措施暂停您的账号的登录和使用。<br/>
      （6）启明荣光违反本条第一款项的约定，未及时采取措施暂停您的账号的登录和使用，因此而给您造成损失的，将承担其相应的法律责任。<br/>
      （7）如果您没有提供其个人有效身份证件或者您提供的个人有效身份证件与所注册的身份信息不一致的，启明荣光有权拒绝您的上述请求。<br/>
      （8）当您为了维护您的合法权益，向启明荣光提供与所注册的身份信息相一致的个人有效身份信息时，启明荣光将为您提供账号注册人证明、原始注册信息等必要的协助和支持，并根据需要向有关行政机关和司法机关提供相关证据信息资料。<br/>
      5、使用限制<br/>
      您在遵守国家法律、法规、政策及本协议的前提下，可依本协议使用本软件。您无权也不得实施包括但不限于下列行为：<br/>
      （1）删除本软件中的任何版权申明或提示以及任何其他信息、内容。<br/>
      （2）对本软件进行反向工程、反向汇编、反向编译等。<br/>
      （3）在本协议规定的条款之外，使用、复制、修改、租赁或转让本软件或其中的任一部份。<br/>
      （4）向第三人提供本软件，许可他人使用本软件或将本软件用于启明荣光禁止的目的（如商业目的等）。<br/>
      （5）对本软件的图像、文字等相关信息，擅自实施包括但不限于下列行为：使用、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点、擅自借助本软件发展与之有关的衍生产品、作品及服务等。<br/>
      （6）利用本软件储存、发表、传播违反国家法律、法规以及国家政策规定的内容。<br/>
      （7）利用本软件储存、发表、传播侵害他人知识产权、商业秘密等合法权利的内容。<br/>
      （8）进行危害计算机网络安全的行为。<br/>
      6、服务的中止与终止<br/>
      （1）如果您存在发布违法信息、严重违背社会公德、以及其他违反法律禁止性规定的行为，启明荣光有权立即终止对您提供服务。<br/>
      （2）如果您在接受甲方服务时违反本协议第5条使用限制及其他启明荣光服务条款、最终用户许可协议、隐私政策的，启明荣光有权终止对您提供服务。<br/>
      （3）如果您提供虚假注册身份信息，或实施违反本协议的行为，启明荣光有权在合理期间内中止对您提供全部或部分服务；启明荣光在采取中止措施时将通知您并告知中止期间，中止期间届满后启明荣光将及时恢复对您的服务。<br/>
      （4）启明荣光根据本条约定中止或终止对您提供部分或全部服务的，将承担相应举证责任。<br/>
      7、技术支持<br/>
      本协议下，启明荣光及其许可人不提供关于本软件的任何技术支持服务。<br/>
      8、版本升级<br/>
      本软件将来是否提供升级版本将由启明荣光决定。如果本软件经启明荣光同意升级，除非升级版本有替代的软件许可协议，否则升级版本仍适用本协议。如果该软件标明为升级版本，您必须遵守本协议。<br/><br/>
      9、法律责任<br/>
      （1）您同意，使用本软件的风险由您自行承担。<br/>
      （2）您认可，本软件可能受到各种安全问题的侵扰，如他人利用您的资料，造成现实生活中的骚扰。下载安装的软件中含有“特洛伊木马”等病毒，威胁到您的信息和数据的安全，继而影响本软件的正常使用等等。您应加强信息安全及信息资源的保护意识，要注意加强密码保护，以免遭致损失和骚扰。<br/>
      （3）本软件按“原样”授予许可。启明荣光及其许可人就本软件不提供任何明示的或默示的担保和保证，包括不对本软件的适销性、特定用途做任何明示或默示的保证，启明荣光及其许可人不就不侵犯第三方权利作任何保证。<br/>
      （4）在适用法律所允许的最大范围内，启明荣光及其许可人绝不就因使用或不能使用本软件所引起的或有关的任何直接的、间接的、意外的、特殊的、惩罚性的或其它任何损害（包括但不限于因人身伤害或财产损坏而造成的损害赔偿，因利润损失、营业中断、商业信息的遗失而造成的损害赔偿，因未能履行包括诚信或相当注意在内的任何责任致使隐私泄露而造成的损害赔偿，因疏忽而造成的损害赔偿，或因任何金钱上的损失或任何其它损失而造成的损害赔偿）承担赔偿责任，即使启明荣光及其许可人事先被告知该损害发生的可能性。启明荣光及其许可人承担的所有责任以您购买本软件所支付的价款为限。本条款在任何情况下都将有效。<br/>
      （5）非经启明荣光及其许可人授权的其它任何由本软件衍生的软件，均属非法。下载、安装、使用此类软件，将可能导致不可预知的风险，建议您不要轻易下载、安装、使用，由此产生的一切损失、损害以及法律责任与纠纷将由您承担责任，与启明荣光无关。<br/>
      （6）对于您违法或违反本协议而引起的一切责任，由您负全部责任，若导致启明荣光损失的，启明荣光有权要求您全额赔偿。<br/><br/>
      10、权利终止<br/>
      启明荣光或其许可人有权随时中止或终止本协议。本协议终止后，您必须立即停止使用本软件，删除已经复制、安装的所有软件及相关资料。<br/>
      11、网络安全与隐私保护<br/>
      基于保护用户个人信息的基本原则，启明荣光将会采取合理的措施保护您的个人信息。除法律法规规定的情形外，未经您的许可启明荣光不会向第三方公开、透露用户个人信息。启明荣光对相关信息采用专业加密存储与传输方式，保障用户个人信息的安全。<br/>
      一般情况下，你可随时浏览、修改自己提交的信息，但出于安全性和身份识别的考虑，你无法修改注册时提供的初始注册信息及其他验证信息。<br/>
      启明荣光将运用各种安全技术和程序建立完善的管理制度来保护你的个人信息，以免遭受未经授权的访问、使用或披露。<br/>
      未经你的同意，启明荣光不会向启明荣光以外的任何公司、组织和个人披露你的个人信息，但下列情况除外：<br/>
      （1）您或您的监护人授权启明荣光披露的；<br/>
      （2）有关法律要求启明荣光披露的；<br/>
      （3）司法机关或者行政机关基于法定程序要求启明荣光提供的；<br/>
      （4）启明荣光为了维护自己合法权益而向乙方提起诉讼或者仲裁时；<br/>
      （5）应您的监护人的合法要求而提供您的个人身份信息时。<br/>
      12、其他条款<br/>
      （1）本协议任何条款的部分或全部无效，不影响其它条款的效力。<br/>
      （2）本协议的解释、效力及纠纷的解决，适用于中华人民共和国法律。因本协议发生任何纠纷或争议，首先应友好协商解决，协商不成的，您在此完全同意将纠纷或争议提交深圳仲裁委员会仲裁裁决，仲裁裁决是终局的，对双方具有约束力。仲裁的所有费用将由仲裁败诉方承担。<br/>
      （3）有关本软件的问题，您可拨打启明荣光客户服务热线咨询。<br/>

      感谢您对启明荣光的支持，为了更好的解答您的疑问和保护您的权益，请在继续之前仔细阅读以下说明：<br/>
      为了更好的提高产品的稳定性，启明荣光将会收集您的产品的一些错误信息和技术数据，启明荣光请您授予启明荣光对以下信息进行收集和分析的权利：<br/>
      （1）设备信息：如手机操作系统、手机语言、终端型号、手机联网模式、手机SIM卡等。<br/>
      （2）客户端信息：如客户端版本号、客户端下载渠道、用户打开/关闭客户端的时间等。<br/>
      （3）应用信息：如应用报错信息、服务是否启动等。<br/>
      如果您不希望您的上述信息被启明荣光收集和分析，请您不要继续，退出本程序。<br/>
      另外，本软件在使用过程中需访问网络，所产生的流量费用由运营商收取，详情请咨询您所属的运营商。<br/>
      如果您有任何问题，您可以和启明荣光联系以取得详细资讯。<br/>
      西安启明荣光科技有限公司版权所有，保留在法律许可范围内的解释权。<br/>
</p>
    </div>
  </div>
</template>

<script>
export default {
  name: 'user-agreement',

  methods: {
    back () {
      this.$router.back()
    }
  }
}
</script>
<style lang="scss" scoped>
@import '~@/styles/handler.scss';
.user-agreement{
  box-sizing: border-box;
  padding: 10px;
}
.header{
  height: 50px;
  display: flex;
  align-items: center;
  justify-content: space-between;
  &-left{
    display: flex;
    align-items: center;
  }
  &-right{
    cursor: pointer;
    font-size: 12px;
    @include color('primary');
  }
}
.logo{
  width: 40px;
  margin-right: 10px;
}
.name{
  font-size: 25px;
  font-weight: 600;
  cursor: pointer;
}
.content{
  border: 1px solid #000;
  border-radius: 5px;
  line-height: 20px;
  box-sizing: border-box;
  padding: 10px 20px;
  &-main{
    text-indent: 28px;
  }
}
.title{
  font-size: 30px;
  text-align: center;
  line-height: 60px;
  font-weight: 600;
}
</style>
